---
kind: property
id: P:Autodesk.Revit.DB.DoubleArray.Item(System.Int32)
source: html/b5dfda40-3c8e-3a25-5754-a0a3e85cd3e4.htm
---
# Autodesk.Revit.DB.DoubleArray.Item Property

Gets or sets a double at a specified index within the array.

## Syntax (C#)
```csharp
public virtual double this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the double to be set or retrieved.

## Returns
Returns the double at the specified index.